<h1>توزیع دبیان</h1>
<h2>بررسی سریع : </h2>
<p>
    دبیان یکی از اولین توزیع های لینوکسه که خیلی هم خوبه (چون کاملا رایگان و اپن سورسه!) ، وقتی میخواستن این توزیع رو بسازن
    اصلا به فکر تجاری کردنش نبودن و حتی پشتیبانی مالی هم نداشتن ، اما تونستن یه یچیز فوق‌العاده درست کنن که در دسترس همه باشه تا جایی
    که الان خیلی از توزیع های دیگه از همین توزیع شکل گرفتن.
    <br>
    نکته دیگه ایی که در مورد این توزیع لینوکسی میشه داد ، اینه که این توزیع هم سمت سرور و هم سمت کاربر میتونه اجرا بشه (سمت سرور یعنی روی یه سرور مجازی و سمت کاربر هم یعنی به صورت خونگی استفاده بشه!)؛
    خود توزیع دبیان 3 تا نسخه متفاوت برای دانلود داره به نام های پایدار (Stable) ، ناپایدار (Unstable) و تست (Testing) که یه فرق های
    ریزی باهم دیگه دارن. اما اگه بخوام به طور خلاصه فرق هاشون رو براتون توضیح بدم اینجوریه که نسخه پایدار بیشترین امنیت و کمترین باگ رو داره ولی آخرین نسخه منتشر شده نیست!
    از یه طرف دیگه یه نسخه ناپیدار داره که آخرین نسخه است ولی ممکنه باگ داشته باشه! و نسخه تست هم برای توسعه دهندگانه و میشه گفت یچیزی بین پایدار و ناپایداره!
</p>
<h2>توزیع های مرتبط : </h2>
<p>
    همونطوری که بالاتر اشاره کردم دبیان یه توزیع پایه است و خیلی از توزیع های دیگه بر پایه دبیان به وجود اومدن. مثلا توزیع قدرتمند اوبنتو
    که احتمالا اسمشم شنیدید از دبیان ساخته شده و توزیع مینت (Mint) هم از ابونتو ساخته شده که یعنی توزیع مینت هم پایه اصلیش از دبیان میاد!
</p>
<h2>پکیج منیجر :</h2>
<p>
    پکیج منیجر رو اگه بخوام به طور خلاصه توضیح بدم یعنی نرم افزاری داخل سیستم عامل که میتونید باهاش نرم افزار ها و پیکج های مختلف رو دانلود و نصب کنید(ولی به صورت کلی یعنی مدیریت بسته های نصبی - یجور مدیریت برنامه هامونه).
    هر توزیع پکیج منجیر مخصوص خودش رو داره و حتی ممکنه دستورات نصب متفاوتی داشته باشه ولی فعلا این مبحثو پس ذهنتون نگه دارید تا به وقتش
    به درس پکیج منیجر ها برسیم.
    پکیج منیجری که خانواده دبیان ازش استفاده میکنه dpkg و ابزار APT است.
    (dpkg مخفف Debian package است!)
</p>
<!-- Slider -->
<swiper-container>
    <swiper-slide>
        <img src="https://phoenixnap.com/kb/wp-content/uploads/2022/03/dpkg-i-deb-package-terminal-output.png"
             alt="dpkg" loading="lazy">
    </swiper-slide>
</swiper-container>
<!-- Slider -->
<h2>استفاده :</h2>
<p>
    استفاده و نصب هم از دبیان خیلی آسونه و طریقه سختی نداره ، چون به صورت گرافیکیه و مراحل پیچیده ایی برای نصب نداره. همینطور پیکربندی
    و تنظیماتشم پیچدیدگی بالایی نداره و ارتباط خوبی با هسته لینوکس برقرار میکنه!
</p>
<b>
    توجه داشته باشید نیاز نیست بقیه توزیع هارو هم یاد بگیرید فقط اطلاعات کافی در موردش داشته باشید بد نیست.
    در هر صورت میتونید برید درس بعد یا اگه حوصله ندارید برید فصل بعدی تا با چیزای اساسی و مهم آشنا بشیم!
</b>

<!-- Slider -->
<swiper-container>
    <swiper-slide>
        <img src="https://www.debian.org/Pics/calamares-bookworm.png"
             alt="debian" loading="lazy">
    </swiper-slide>
    <swiper-slide>
        <img src="https://www.fosslinux.com/wp-content/uploads/2022/02/Xfce-desktop.png"
             alt="debian" loading="lazy">
    </swiper-slide>
</swiper-container>
<!-- Slider -->
