<h1>دستور cat</h1>
<h2>خواندن محتویات فایل </h2>
<p>
    خب خب ، تا حالا در مورد خیلی چیزا یاد گرفتیم و تا حالا فهمیدیم چجوری یه فایل بسازیم و چجوری بفهمیم که چه نوع فایلیه!
    ولی اگه حواستون باشه یچیزی کمه!! فرضا کنید یه فایل متنی درست کردید یا یه عکس دانلود کردید، خیلی راحت میتونید با دستور file ببیند چه فرمتی داره
    اما اگه بخوایم فایل متنیمون رو بخونیم باید چیکار کنیم؟ هان؟
    <br>
    آفرین ، دستور امروز همین کارو میکنه و باعث میشه بتونیم یه فایل رو بخونیم. بزارید باز مثال بزنیم و توی کد بیشتر باهاش آشنا بشیم :
</p>
<pre>
            <code>
                touch my.txt
                cat my.txt
                # اگه تا اینجا تست کنید متوجه میشید که فایل خالی خروجی نداره که عجیبم نیست
                # اما حالا یه فایل متنی از قبل آماده کردیم و اون رو صدا میزنیم
                cat hi.txt
                Hello World
                # داخل فایل صدا زده شده دقیقا همین متن نوشته شده.
            </code>
        </pre>
<br>
<b>
    توجه کنید که میتونید چندین فایل رو هم باهم صدا بزنید (که بهم متصلشون میکنه) و متن داخلشون رو بخونید (البته از الان گفته باشم که این دستور برای خوندن فایل های ساده و کوتاست) :
</b>
<pre id="Command">
            <code>
                cat hi.txt bay-bay.txt
                Hello World
                Buy Buy Single Life :)
            </code>
        </pre>
<b>
    این دستور همینقدر ساده است (فعلا برای مقدمات ساده است) !!! همچنین بدونید که دستور cat به معنای گربه نیست و مخفف concatenate (به هم چسبوندن) است که بالاترم گفتیم وقتی دوتا یا چنتا فایلو باهم صدا بزنید بهم وصلشون میکنه!
    و هیچ ربطی به گربه و حیوانات نداره!
</b>