<?php
return [
    'title' => 'دستور cat',

    'has_slider' => false,
    
    'exercises' => [
        'واقعا باید تمرین بدم ؟ خب نمیدم! ولی در کل بهتره روی فایل ها و فرمت های مختلف تست کنید تا ببیند چه نتیجه ایی میده. مثلا روی فرمت های عکسی و پی دی افی حتما امتحان کنید قشنگای باباتون!'
    ],

    'quizzes' => [
        'دستور cat برای چه کاری استفاده میشه ؟',
        'دستور cat هر فایلی رو میخونه؟'
    ],

    'next_lesson' => [
        'url' => 'less-command',
        'title' => 'دستور less',
        'is_season' => False
    ]
];