<h1>پوسته یا Shell در لینوکس</h1>
<p>
    اولین بحثی که میخوایم در موردش صحبت کنیم ، پوسته (Shell) است ؛ ولی اصلا پوسته یعنی چی ؟
    شما وقتی لینوکس خودتون رو نصب میکنید از طریق برنامه ایی به نام ترمینال (توی ویندوز بهش میگن CMD) با هسته لینوکس ارتباط برقرار میکنید.
    و دستوراتی رو میتونید توی ترمینال (خط فرمان) وارد کنید. صد در صد تا حالا دیگه ترمینال رو یبار باز کردید و یچیزی شبیه مورد زیر مشاهده کردید :
</p>
<pre>
            <code>
                username@hostname:current_directory $

                Amirroox@Linux: /home/Desktop $
            </code>
        </pre>
<p>
    خط اولی که نوشتم حالت کلی نمایشه ، و خط دومی که نوشتم توی ترمینال خودمه!
    به طور کلی توی ترمینال ، قسمت اول اسم یوزر میاد، بعد یه @ قرار میگیره و اسم هاست لینوکس میاد.
    بعد از اون هم یه دو نقطه قرار میگیره و مسیری که توش هستید نمایش داده میشه؛ و در آخر هم یه علامت دلار چاپ میشه (البته در پوسته های مختلف علامت های مختلفی وجود داره!) که بعد از اون میتونید
    دستورات خودتونو وارد کنید!
    <br>
    <b>
        توجه کنید که گفتم مسیری که توش هستید؛ مثلا اگه توی دسکتاپ یه پوشه بسازید به نام "فلان" و داخل این پوشه
        هم یه پوشه دیگه به نام "فلان 2" بسازید، اگه برید داخل پوشه "فلان 2" مسیری که توش هستید برابر میشه با : "دسکتاپ / فلان / فلان 2"
    </b>
    <br>
    حالا اینایی که گفتیم چه ربطی به پوسته داشت؟ کامپیوتر فقط 0 و 1 رو میفهمه و ماهم نمیتونیم تمام دستورات 0 و 1 رو حفظ کنیم!
    پس پوسته به وجود اومد تا بتونه کار مارو راحت کنه و دستوراتی که وارد میکنیم رو به زبان کاپیوتر (0 و 1) ترجمه کنه!
    <br>
    <b>
        پس به طور کلی Shell یعنی یه رابط کاربری بین کاربر و هسته لینوکس! یا بخوایم یکم بازترش کنیم، میتونیم بگیم
        یه قطعه نرم افزاره که به من و شما اجازه میده دسترسی مستقیم داشته باشیم به سیستم عامل!
    </b>
    <br>
    شما وقتی ترمینال روباز میکنید به طور خودکار پوسته Bash اجرا میشه (البته پوسته های مختلف دیگه ایی هم مثل zsh داریم، اما به طور پیشفرض اکثر توزیع های لینوکس از پوسته bash استفاده میکنن!)
    <br>
    حالا که فهمیدیم پوسته چیه بیاین اولین دستورمونو توی ترمینال بنویسیم :
</p>
<pre id="Command">
            <code>
                echo Hello World
                hello World
            </code>
        </pre>
<p>
    فعلا زیاد درگیر echo نشید ، ولی در همین حد بدونید که اگه جلوی دستور echo هر چیزی رو وارد کنیم ، برامون چاپش میکنه!
    <br>
    <b>
        توجه کنید که به حروف بزرگ و کوچیکم حساسه! پس کلمه echo رو همینجوری که نوشتم بنویسید!
    </b>
</p>

<!-- Slider -->
<swiper-container>
    <swiper-slide>
        <img src="https://d8it4huxumps7.cloudfront.net/uploads/images/640fed807bc17_diagram_1.jpg"
             alt="Shell" loading="lazy">
    </swiper-slide>
    <swiper-slide>
        <img src="https://media.geeksforgeeks.org/wp-content/uploads/cli_example.png"
             alt="Shell" loading="lazy">
    </swiper-slide>
</swiper-container>