<?php
return [
    'title' => 'دستور rm',

    'has_slider' => false,
    
    'exercises' => [
        'چنتا فایل و فولدر بسازید، و توی بعضیاش رو خالی بزارید، توی بعضیارو پر کنید و کلا با دستوراتی که تا الان یاد گرفتید بازی کنید :)',
        'یه فلگ دیگه داریم به نام I که برید ببینید این دقیقا چیکار میکنه، راهنما هم اینکه شبیه i عه!'
    ],

    'quizzes' => [
        'یه پوشه خالی رو چجوری میشه پاک کرد؟',
        'یه پوشه پُر رو چجموری میشه نابود کرد؟',
        'اگه برای پاک کردن یه فایل مشکل داشتیم، چجوری پاکش کنیم؟'
    ],

    'next_lesson' => [
        'url' => 'find-command',
        'title' => 'دستور find',
        'is_season' => False
    ]
];