<h1>دستور mkdir</h1>
<h2>ساخته دایرکتوری یا همون پوشه خودمون</h2>
<P>
    بلخره همه نیاز داریم یه پوشه بسازیم تا توش کارامون رو بریزیم، و همینجوری نمیایم رو دسکتاپ رو پر نمیکنیم (البته خیلیا میکنن)، برای اینکه بتونید
    پوشه خودتون رو بسازید از دستور mkdir که مخفف make directory عه استفاده میکنیم! همچنین این دستور هم مثل خیلی از دستور ها میتونه چنتا کار بکنه (منظورم اینه که میتونه چنتا پوشه همزمان بسازه) مثل زیر:
</P>
<pre>
    <code>
        mkdir books movies "dont touch"

        # کاری نداشته باشید که تو پوشه آخر چیه! اما چون بینش فاصله داره توی دابل کوتیشن گذاشتمش
    </code>
</pre>

<p>
    حالا بعضی وقتا میخوایم یه پوشه بسازیم که توش یه پوشه دیگه باشه، اگه اون پوشه از قبل وجود نداشته باشه mkdir خطا میده، برای همین باید از فلگ p استفاده کنیم که مخفف parent عه.
    حالا با این فلگ میتونیم یه پوشه داخل یه پوشه دیگه بسازیم، حتی وقتی اون پوشه اولیه از اول وجود نداشته باشه. مثل این:
</p>

<pre>
    <code>
        mkdir -p books/persian
    </code>
</pre>