<?php
return [
    'title' => 'دستور file',

    'has_slider' => false,
    
    'exercises' => [
        'فقط یه تمرین دارید که برای خودتونم میتونه جذاب باشه! برید چنتا چیز مختلف دانلود کنید با فرمت های مختلفی مثل jpg, png, pdf, txt, iso و هر فرمتی که دلتون خواست و با دستور file ببینید چه خروجی به شما میده!'
    ],

    'quizzes' => [
        'دستور file میتونه چنتا فایل رو هم همزمان قبول کنه؟',
        'دستور file فقط فرمت رو نمایش میده؟'
    ],

    'next_lesson' => [
        'url' => 'cat-command',
        'title' => 'دستور cat',
        'is_season' => False
    ]
];