<h1>دستور mv</h1>
<h2>جابه جایی فایل ها و تغییر نام</h2>
<p>
    این دستور هم دقیقا مشابه با دستور cp کار میکنه! فلگ ها و آپشن هایی که داره هم مشابه با دستور cp عه. پس به طور کلی
    درکش ایزیه (سادست).
    فقط باید توجه کنید که این دستور علاوه بر اینکه میتونه فایل هارو براتون جابه جا کنه، میتونه اسم فایلتونم خیلی سریع
    عوض کنه! پس حواستون باشه چجوری
    ازش استفاده میکنید قشنگا.
    با مثال زیر میتونید اسم فایلتون رو تغییر بدید:
</p>
<pre>
    <code>
        mv oldFileName newFileName
    </code>
</pre>
<p>
    به طور کلی هم اگه بخوایم بهش نگاه کنیم، جابه جایی فایل توی مسیر قبلی، باید روی فایل قبلی جایگزین بشه، پس وقتی با اسم دیگه ایی جابه جایی رو انجام میدیم
    اسم فایل تغییر میکنه.
    <br>
    به شکل زیر میتونیم فایلمون رو بندازیم یه جای دیگه:
</p>
<pre>
    <code>
        mv fileName /home/AmirRoox/Documents
        # دستور بالا با نام قبلی جابه جایی رو انجام میده
        mv fileName /home/AmirRoox/Documents/newFileName
        # دستور بالایی هم با اسم جدید این کارو انجام میده
    </code>
</pre>
<p>
    همچنین میتونید چنتا فایل رو باهم منتقل کنید، که کارو ساده تر موکونه!
</p>
<pre>
    <code>
        mv fileName1 fileName2 /home/AmirRoox/Documents

        mv *.txt /home/AmirRoox/Documents/text
        # دستور بالا که توش از ستاره استفاده شده، میاد هرچیزی که آخرش تی اکس تی داره رو انتخاب میکنه و میفرسته تو اون مسیری که من میخوام، جالبه.
    </code>
</pre>
<p>
     همچنین این دستور فقط برای فایل نیست و به راحتی میتونید دایرکتوری هارو هم جابه جا کنید. دقیقا مثل دستور cp دستور mv هم یه فلگ داره به نام i که موقعه جابه جایی
    ازتون سوال میکنه که اگه فایل یا پوشه از قبل وجود داشته باشه، بازنویسی انجام بده یا نه! اینجاهم مثالشو زدم:
</p>
<pre>
    <code>
        mv fileName1 fileName2 /home/AmirRoox/Documents

        mv *.txt /home/AmirRoox/Documents/text
        # دستور بالا که توش از ستاره استفاده شده، میاد هرچیزی که آخرش تی اکس تی داره رو انتخاب میکنه و میفرسته تو اون مسیری که من میخوام، جالبه.
    </code>
</pre>
<p>
    یه فلگ خیلی سوپرمن (اسپایدر من، من فن اینم) داریم که خیلی جالبه. شما میتونید از فلگ b استفاده کنید.
    این فلگ چیکار میکنه؟ فرض کنید یه فایل دارید و میخواید رو یه فایل دیگه بازنویسی کنید، مثلا فایل t1.txt رو دارید میخواید تو یه مسیر دیگه به نام t1.txt ذخیرش کنید.
    حالا تو اون مسیر یه فایل به نام t1.txt از قبل وجود داره و نمیخواید محتواش از دست بره! میاید از فلگ b استفاده میکنید و توی مسیر جدید فایل t1.txt به شکل ~t1.txt ذخیره میشه!
    <br>
    واضح تر بگم، یعنی فایل t1.txt که میخواستید جابه به جا کنید به همین نام ذخیره میشه تو مسیر جدید و فایل قبلی توی ~t1.txt ذخیره میشه! یک تیر و دو نشون! مثالشم این زیره:
</p>
<pre>
    <code>
        mv -b t1.txt /home/AmirRoox/Documents/t1.txt
    </code>
</pre>