<h1>توزیع لینوکس مینت</h1>
<h2>بررسی سریع : </h2>
<p>
    لینوکس مینت بر پایه اوبنتو ساخته شده و خود ابونتو هم از دبیان ساخته شده ، پس هردوشون یه توزیع بر پایه دبیان هستن!
    طراحان لینوکس مینت میخواستن یه توزیع مدرن و زیبا معرفی کنن که علاوه بر محیط قشنگش ، کار باهاش راحت باشه.
    این توزیع رابط های متفاوتی برای آسون کردن کارها داره و همچنین میتونید منوها و خود Desktop رو هم شخصی سازی کنید.
    <br>
    همچنین یه مورد خیلی خوب در این توزیع سازگاری کامل با مخازن ابونتو است (در بخش پکیج منیجر ها در مورد مخزن ها هم صحبت میکنیم ، ولی تا فعلا بدونید هر توزیع برای خودش یه مخزن داره و میتونید از اونجا توزیع رو آپدیت کنید یا برنامه ایی رو نصب کنید!)
    <br>
    در کل این توزیع یه توزیع خیلی قوی مثل اوبونتوعه (و در خیلی چیزا مشابه است) و حتی ممکنه ظاهر قشنگ تریم داشته باشه ، برای همین اگه نظر من رو بخواید میتونید با این توزیع شروع کنید.(خودم چنتا توزیع دارم ولی با کالی لینوکس (یه توزیع برای هک) و مینت بیشتر کار میکنم! البته اگه اصلا میخواستید بدونید من با چی کار میکنم!)
</p>
<h2>پکیج منیجر :</h2>
<p>
    چون این توزیع هم بر پایه دبیان است پس از پکیج منیجر خانواده دبیان یعنی APT و dpkg استفاده میکنه!
</p>
<h2>استفاده :</h2>
<p>
    از این توزیع هم میشه روی سرور استفاده کرد ، اما به ندرت استفاده میشه و برای سیستم های رومیزی و خونگی خیلی بهتره!
</p>
<b>
    منم تو این آموزش از توزیع های بر پایه دبیان استفاده میکنم! یعنی از خود مینت استفاده میکنم!
</b>

<!-- Slider -->
<swiper-container>
    <swiper-slide>
        <img src="https://upload.wikimedia.org/wikipedia/commons/2/2e/Linux_Mint_21_%22Vanessa%22_%28Cinnamon%29.png"
             alt="linux mint" loading="lazy">
    </swiper-slide>
    <swiper-slide>
        <img src="https://tecadmin.net/static/linux-distributions/linuxmint.webp"
             alt="linux mint" loading="lazy">
    </swiper-slide>
    <swiper-slide>
        <img src="https://debugpointnews.com/wp-content/uploads/2022/07/mint-generic-head.jpg"
             alt="linux mint" loading="lazy">
    </swiper-slide>
</swiper-container>
<!-- Slider -->
