<?php
return [
    'title' => 'دستور ls',

    'has_slider' => false,
    
    'exercises' => [
        'خب چنتا تمرین دارید که باید انجام بدید، فلگ های R، r و t رو تست کنید و ببینید چجوری کار میکنن.',
        'ممکنه با تست کردن یکمی براتون سخت باشه فهمیدن اینکه چیکار میکنن ، پس یه راهنمایی کوچیک براتون دارم! پرچم r- مخفف reverse ، پس خیلی راحت میشه فهمید چیکار میکنه!',
        'پرچم t- مخفف time که اینم روشه که چیکار میکنه(بر اساس زمان مرتب‌سازی میکنه) و در آخر پرچم R- مخفف کلمه recursive به معنی بازگشتیه که اگه بخوام راهنمایی کنم کارش اینه که فایل ها و پوشه های داخل پوشه هارو هم بهتون نمایش میده (خودتون تست کنید بیشتر متوجه میشید!)',
    ],

    'quizzes' => [
        'با چه دستوری میشه تمامی فایل های یه دایرکتوری رو دید (حتی فایل های مخفی)؟',
        'پرچم l (اِل) چه کاری انجام میده ؟',
        'میشه از پرچم ها باهم استفاده کرد؟'
    ],

    'next_lesson' => [
        'url' => 'touch-command',
        'title' => 'دستور touch',
        'is_season' => False
    ]
];