<h1>توزیع اُپِن سوزه</h1>
<h2>بررسی سریع : </h2>
<p>
    این توزیع هم مثل توزیع دبیان و فدروا از کرنل اصلی لینوکس ساخته شده و یک محصول مستقل به حساب میاد.این پروژه یه پروژه کاملا اجتماعی
    و انجمن محور بوده ، پس کاملا هم رایگانه!
    این توزیع 3 هدف اصلی داشت : ساده و آسون باشه ، که یعنی هرکسی به راحتی بتونه دانلود و نصبش کنه. دوم اینکه تلاش کنه به عنوان یه توزیع رایگان بیشترین استفاده رو داشته باشه.
    و سوم اینکه بتونه برای برنامه نویسا و توسعه دهنده ها محیط خوبی رو ایجاد کنه.(در کل دوست داشته اول به حساب بیاد ، منم عصبی شدم آخر گذاشتمش :( )
    <br>
    این توزیع انعطاف پذیری بالایی داره و بروزرسانی خوبی ر هم دریافت میکنه ، اما از مشکلاتش میشه به سرعت کمتر نسبت به بقیه توزیع ها اشاره کرد(که زیاد خوشایند نیست!).
    همچنین یکی از موارد خیلی مهم دراین توزیع امنیته ، یعنی کوچک ترین کاری بدون اطلاع به کاربر توی سیستم عامل انجام نمیشه! و همچنین جزو معدود
    توزیع هاییه که موقعه نصب میتونید بسته های نرم افزاری خودتون رو تک به تک انتخاب کنید.
</p>
<h2>پکیج منیجر :</h2>
<p>
    این توزیع پکیج منیجر مخصوص خودش رو نداره و از پکیج منیجر RPM استفاده میکنه.
</p>
<h2>استفاده :</h2>
<p>
    همونجوری که گفتیم این توزیع خیلی آسونه و برای کاربران جدید یه انتخاب عالیه! همچنین یه برنامه گرافیکی به نام
    YaST داره که کار مدیریت سیستم و برنامه هارو براتون خیلی آسون میکنه!
    <br>
    این توزیع رو هم میشه در سرور و هم به صورت خانگی استفاده کرد و به گفته بعضی از سایت ها جزو 10 توزیع برتر لینوکس به حساب میاد.
</p>

<!-- Slider -->
<swiper-container>
    <swiper-slide>
        <img src="https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/OpenSUSE_Logo.svg/1200px-OpenSUSE_Logo.svg.png"
             alt="OpenSUSE" loading="lazy">
    </swiper-slide>
    <swiper-slide>
        <img src="https://debugpointnews.com/wp-content/uploads/2022/06/openSUSE-Leap-15.4-GNOME-Desktop.jpg"
             alt="OpenSUSE" loading="lazy">
    </swiper-slide>
</swiper-container>
<!-- Slider -->
