<h1>توزیع ردهت</h1>
<h2>بررسی سریع : </h2>
<p>
    اول بگیم که اسم کامل این توزیع Red Hat Enterprise Linux است که به مختصر بهش RHEL گفته میشه.قبل از بررسی
    پیشرفته باید بگم که این توزیع یکی از محدود توزیع هایه که از قوانین و لایسنس GNU پیروی نمیکنه(بخوام خیلی آسون بهتون بگم ، یعنی خیلی آزاد و رایگان نیست!)،
    همچنین این توزیع از توزیع Fedora شکل گرفته که در درس های بعدی حتما باهاش سروکار داریم!
    همچنین این توزیع هم میتونه به عنوان سرور مجازی و هم سرور خانگی استفاده بشه؛ ولی یادتون باشه گفتم این توزیع رایگان نیست و باید بخریدش!
    <br>
    مورد بعدی اینکه این توزیع رو با توزیع Red Hat خالی اشتباه نگیرید (اسم کاملش Red hat Commercial Linux بود) ، توزیع Red Hat قبلی از سال 2004 به بعد تولید نشد و این محصول جدیدیه
    که اسم کاملشم بالاتر گفتیم.
</p>
<h2>پکیج منیجر :</h2>
<p>
    ردهت اولین توزیع از لینوکس بود که از پکیج منیجر جدیدی استفاده کرد و همین کار باعث شد توزیع های جدیدتر هم از این قالب بندی استفاده کنن.
    پکیج منیجری که ردهت (و خانواده فدورا) ازش استفاده میکنه RPM Package Manager است که با این پکیج منیجرم در فصل های بعدی آشنا میشیم، پس فعلا فقط اینارو بدونید!
</p>
<h2>استفاده :</h2>
<p>
    استفاده از ردهت یکمی سختتر از دبیانه ولی بازم نمیشه گفت برای استفاده خیلی پیچیده است ، بلکه با کمی دانش فنی پایه میشه راحت ازش استفاده کرد.
    و توجه کنید که این توزیع بیشتر برای سرور استفاده میشه (همونطوری که از اسم کاملشم مشخصه) پس اگه سرور دارید یا سیستم قوی دارید از این
    توزیع استفاده کنید.(البته مشخصات سیستمی قوی هم نیاز نداره ، اما برای شروع هزینه نکنید بهتره و با چیزای رایگان هم کارتون راه میوفته!)
</p>
<!-- Slider -->
<swiper-container>
    <swiper-slide>
        <img src="https://media.geeksforgeeks.org/wp-content/uploads/20201109002948/searchbar.png"
             alt="redhat" loading="lazy">
    </swiper-slide>
    <swiper-slide>
        <img src="https://www.unixsysadmin.com/wp-content/uploads/sites/3/2022/07/RHEL9.png"
             alt="redhat" loading="lazy">
    </swiper-slide>
</swiper-container>
<!-- Slider -->