<h1>دستور rmdir</h1>
<h2>پاک کردن پوشه های خالی</h2>
<p>
    حالا که یادگرفیتم پوشه بسازیم، بلخره باید یاد بگیریم که چجوری پاکشون کنیم! البته توجه کنید که دستور rmdir برای پاک کردن پوشه های خالی کاربرد داره و پوشه هایی که پر هستن رو با دستور rm که توی
    جلسه بعدی کار میکنیم، میتونیم پاک کنیم.
    روش کار باهاشم خیلی سادست و فلگ خاصی هم نداره جز همون فلگ p که برای پاک کردن یه پوشه داخل یه پوشه دیگه کاربرد داره
</p>
<pre>
    <code>
        rmdir flanFile flanFile2

        rmdir -p a/b
        # دستور بالا پوشه بی و اِی رو باهم پاک میکنه که دستور مشابش میشه پایین
        rmdir a/b a
    </code>
</pre>