<h1>انتخاب یه توزیع برای کار</h1>
<p>
    خب ، توی بخش قبلی یا بهتره بگیم درس قبلی با تاریخچه لینوکس آشنا شدیم ولی یه چیزی رو یادمون رفت بگیم که بهتره اینجا تصحیحش کنیم و اونم
    اینه که لینوکس به خودی خودش یه سیستم عامل نیست و وقتی میگیم لینوکس به هسته سیستم عامل اشاره داریم. حالا بعضیا میان و از این هسته
    استفاده میکنن و انواع مختلف سیستم عامل رو میسازن! برای همین معمولا لینوکس به سیستم عامل مشهوره (ولی یادتون باشه گفتم هسته سیستم عامل لینوکسه ، یعنی ازش به عنوان پایه ایی برای ساخت سیستم عامل استفاده میشه!)
    حالا که تصحیح کردیم گفته های قبلمون رو بیاید یه صحبتی در مورد خود لینوکس داشته باشیم. سیستم لینوکس (چیزی که از لینوکس ساخته شده)
    خودش دارای 3 بخش اصلیه (البته بخش های خیلی زیادی داره اما فعلا اساسی تریناشو میگم تا برسیم به وقتش) :
</p>
<ol class="md:mr-10 list-decimal">
    <li>
        هسته لینوکس : همونطوری که بالاتر گفتیم بخش اصلی سیستم عامل همین هسته است و کارشم مدیریت سخت‌افزار و تعامل با سیستمه!
    </li>
    <li>سخت افزار : بلخره یه سیستم عامل باید با یه چیزی اجرا بشه ، و تمامی سخت افزار ها مثل CPU ، حاظفه های جانبی و هرچیز دیگه ایی جزو این دسته است.</li>
    <li>فضای کاربر : همون دسکتاپ خودمون میشه ، بلخره کاربر باید از یه جایی با استفاده از هسته و سخت‌افزار کار خودشو بکنه یا نه؟!</li>
</ol>
<div class="flex justify-center">
    <img src="https://media.geeksforgeeks.org/wp-content/uploads/20200105215737/Untitled-Diagram-215-1.jpg"
         alt="The main parts of Linux">
</div>
<p>
    حالا که اساس سیستم عامل رو فهمیدیم باید یه توزیع انتخاب کنیم (توزیع یه سیستم عامل با هسته لینوکسه و تعدادشونم خیلی زیاده!!) و بعد از انتخاب
    اونو نصبش کنیم. ما توزیع های زیادی از لینوکس داریم ، مثل Fedora ، Ubuntu ، centos ، Kali Linux و ... ولی ما که نمیتونیم همشونو توضیح بدیم! پس چنتا از مهم تریناشونو
    توی درس های بعدی معرفی میکنیم و با علاقه خودتون یکی رو انتخاب کنید (البته توجه داشته باشید که بعدا متوجه میشید بعضی از دستورات توی بعضی از توزیع ها متفاوته!)
    <br>
    توجه کنید که برای نصب هر توزیع یه سرچ کوچیک تو نت بزنید آموزش های قوی و قشنگی رو پیدا میکنید ، ماهم قرار نیست نصب لینوکسو اینجا یاد بدیم
    فقط میخوایم توزیعاشو معرفی کنیم و خودتون انتخاب کنید و نصبش کنید و بعد باهم برسیم سر چیزای اصلی تر و سخت تر!!!
</p>
<br>
<b>
    برای شروع بهتره از توزیع هایی مثل ابونتو ، لینوکس مینت ، دبیان یا OpenSUSE استفاده کنید.من خودم توی این آموزش از مینت استفاده میکنم!
</b>

<!-- Slider -->
<swiper-container>
    <swiper-slide>
        <img src="https://www.atatus.com/blog/content/images/size/w960/2023/01/top-10-linux-distros.png"
             alt="Linux distributions" loading="lazy">
    </swiper-slide>
    <swiper-slide>
        <img src="https://static.thegeekstuff.com/wp-content/uploads/2009/06/top-linux-distros.jpg"
             alt="Linux distributions" loading="lazy">
    </swiper-slide>
    <swiper-slide>
        <img src="https://www.how2shout.com/wp-content/uploads/2019/10/MX-Linux-best-linux-distro-2019.jpg"
             alt="Linux distributions" loading="lazy">
    </swiper-slide>
</swiper-container>
<!-- Slider -->