<h1>دستور cp</h1>
<h2>دستور کپی کردن فایل ها</h2>
<p>
    همونجور که متوجه شدید دستور cp مخفف کلمه copy عه! و چیکار میکنه؟ براتون همه چیزو کپی میکنه. خداییش کنترل سی و کنترل وی هم خوبه ها، اما تو ترمینال یه حال دیگه میده.
    این دستور خیلی ساده است، دستور رو مینوسیم ، آرگومان اولی که بهش پاس میدیم فایل اصلیمونه و آرگومان دومی که بهش میدیم مسیر و اسمیه که میخوایم اونجا کپی بشه.
    برای بهتر متوجه شدن بازم این زیر مینویسم عشق کنید:
</p>
<pre id="Command">
            <code>
                cp maintext.txt /home/download/
                # اگه مثل بالا وارد کنید به همون نام توی مسیر کپی میکنه
                cp maintext.txt /home/download/newfile.txt
                # اگه هم مثل بالا بزارید به نامی که شما دوست دارید کپی میکنه
            </code>
        </pre>
<p>
    حالا کجا این دستور جذاب تر میشه؟ وقتی میخواید چندین فایل با الگو خاص رو کپی کنید!
    فرض کنید تو یه پوشه 600 تا عکس با فرمت jpg دارید و میخواید کپیش کنید تو یه مسیر دیگه، از دستور زیر میتونید استفاده کنید:
</p>
<pre id="Command">
            <code>
                cp *.jpg /home/temp/Pic
            </code>
        </pre>
<p>
    حالا شاید بگید ستاره یعنی چی؟ ستاره یعنی همه چیز! یعنی هرچیزی به هر تعدادی، بعدشم فرمت فایل اومده، پس یعنی هرچیزی که فرمتش jpg بود رو برام انتخاب کن
    و تو مسیری که بهت گفتم کپی کن.
    حالا اگه همین رو برعکس کنیم هم جالب میشه، مثل زیر:
</p>
<pre id="Command">
            <code>
                cp jpg.* /home/temp/Pic
            </code>
        </pre>
<p>
    دستور بالا میاد فقط فایل هایی رو میگیره که اسمشون jpg عه و فرمتشون میتونه هر چیزی باشه! تازه جالب تر هم میشه، مثلا میخواید فایل هایی رو کپی کنید که اولشون ab داره
    برای این کارم از دستور زیر استفاده میکنید:
</p>
<pre id="Command">
            <code>
                cp ab*.jpg /home/temp/Pic
            </code>
        </pre>
<p>
    کنترل سی، کنترل وی، تو خوابشم نمیتونست از این چیزا ببینه!
    <br>
    تازه یه فلگ باحال هم داره، برای زمانی استفاده میشه که شما چنتا پوشه دارید که داخلش چنتا پوشه دیگست و داخل هرکدومش چندین فایل و پوشه دیگه دارید (داخل نیوفولدر 1 ، نیوفولدر 2 و الی آخر (اکثر چیز خوبی تو اینا نبود!))،
    برای همچین کاری از فلگ r استفاده میکنیم که مخفف recursive یا بازگشتیه:
</p>
<pre id="Command">
            <code>
                cp -r newFolder1/ /home/temp/Pic
                # تمامی فایل و پوشه های داخل اون فولدر رو به همراه خود فولدر کپی میکنه
            </code>
        </pre>
<b>شاید بگید ، بدون این فلگ خب همین کارو میکنیم، که باید بگم تست کنید و اگه شد خبر بدید :)</b>
<br>
<p>
    حالا ممکنه یچیزی رو کپی کنید یه جایی ولی یه فایل با همون نام وجود داشته باشه، که خب خیلی راحت رونویسی میشه، برای اینکه این اتفاق نیوفته هم میتونید از فلگ i استفاده کنید
    اینجوری قبل از رونویسی ازتون میپرسه که رونویسی کنم یا نه.
</p>