<?php
return [
    'title' => 'دستور touch',

    'has_slider' => false,
    
    'exercises' => [
        'خب تمرینات امروز خیلی ساده است ولی برای اینکه دستتون گرم بشه، حتما با دستورات قبلی که یاد گرفتید ترکیبشون کنید و توی مسیرهای مختلف فایل بسازید.',
        'چنتا فایل با پسوند های مختلف بسازید (مثلا pdf یا txt)',
        'فایل هایی که از قبل ایجاد کردید رو یبار دیگه بسازید و timestamp رو چک کنید!',
    ],

    'quizzes' => [
        'آیا میشه چنتا فایل رو همزمان هم ساخت ؟'
    ],

    'next_lesson' => [
        'url' => 'file-command',
        'title' => 'دستور file',
        'is_season' => False
    ]
];