<?php
return [
    'title' => 'دستور cd',

    'has_slider' => false,
    
    'exercises' => [
        'یبار دستور cd رو بدون هیچ چیزی اجرا کنید! یعنی خالی بنویسید cd و بعد ببینید چه اتفاقی میوفته! و به چه مسیری انتقال پیدا میکنید!',
        'توی مسیر های مختلف برید و فایل ها و پوشه بندی های مختلف رو مشاهده کنید. (برای خودتون بازی کنید و هی توی پوشه ها جلو عقب برید تا دستتون عادت کنه به این دستور ، چون خیلی استفاده میشه!)'
    ],

    'quizzes' => [
        'فرض کنید توی path یا آدرس home/amir هستید و میخواید وارد مسیر root بشید ، باید چیکار کنید ؟',
        'فرض کنید توی همون مثال بالا میخواید یه خونه برید عقب! چیکار میکنید؟'
    ],

    'next_lesson' => [
        'url' => 'ls-command',
        'title' => 'دستور ls',
        'is_season' => False
    ]
];