<h1>توزیع اوبونتو</h1>
<h2>بررسی سریع : </h2>
<p>
    احتمالا که نه،بلکه حتما اسم اوبنتو به گوشتون خورده! این توزیع یکی از محبوب ترین توزیع های لینوکسیه که همه جا در دسترسه و بر پایه توزیع Debian ساخته شده.
    این توزیع از محیط گرافیکی مخصوص به خودش به نام Unity استفاده میکنه (بقیه توزیع ها هم محیط گرافیکی (رابط کاربری گرافیکی) خودشون مثل GNOME رو دارن که باید توجه کنید هر توزیع برای خودش محیط گرافیکی نمیزنه و از موارد موجود استفاده میکنن و فقط شخصی سازی روش انجام میدن)
    <br>
    از اوبونتو میشه روی سرور ، سیستم خانگی و حتی برای افراد مبتدی و پیشرفته استفاده کرد ، یعنی یه توزیع همه فن حریفه و Community (انجمن) قوی داره
    که به صورت رایگان در دسترس همه است!
    <br>
    زیاد توضیح خاصی ندارم بدم(البته درمورد این توزیع خیلی چیزا میشه گفت ، ولی اگه دوس دارید میتونید سرچ بزنید!) چون واقعا از همه نظر عالیه
    و برای شما عزیزان هم بهترین گزینه برای شروعه!
</p>
<h2>پکیج منیجر :</h2>
<p>
    همونطور که قبلا هم گفتیم این توزیع بر پایه دبیانه پس از پکیج منیجر همون توزیع هم استفاده میکنه، یعنی dpkg و APT.
</p>
<h2>استفاده :</h2>
<p>
    بالاتر گفتم این توزیع یه توزیع همه فن حریفه ، پس همه جا استفاده میشه و برای نصبش هم محیط گرافیکی خیلی ساده ایی داره
    و پیچدگی زیادی برای نصب و استفاده ازش ندارید!
</p>

<!-- Slider -->
<swiper-container>
    <swiper-slide>
        <img src="https://upload.wikimedia.org/wikipedia/commons/0/08/Ubuntu_23.04_Lunar_Lobster_English.png"
             alt="ubuntu" loading="lazy">
    </swiper-slide>
    <swiper-slide>
        <img src="https://9to5linux.com/wp-content/uploads/2023/02/u2204lk.webp"
             alt="ubuntu" loading="lazy">
    </swiper-slide>
    <swiper-slide>
        <img src="https://www.howtogeek.com/wp-content/uploads/2021/11/what-is-ubuntu.png"
             alt="ubuntu" loading="lazy">
    </swiper-slide>
</swiper-container>
<!-- Slider -->
